evidence/of13-high-gradient-v2/incomplete-rerun-2026-10-02/system/controlDict
FoamFile { format ascii; class dictionary; object controlDict; }
solver incompressibleFluid;
startFrom startTime; startTime 0; stopAt endTime; endTime 0.05; deltaT 0.0005;
writeControl runTime; writeInterval 0.05; writeFormat ascii; writePrecision 16;
writeCompression off; timeFormat general; timePrecision 12; runTimeModifiable false;
