evidence/of13-high-gradient-v2/incomplete-rerun-2026-10-02/constant/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }
simulationType laminar;
