evidence/of13-high-gradient-v2/incomplete-rerun-2026-10-02/constant/physicalProperties
FoamFile { format ascii; class dictionary; object physicalProperties; }
viscosityModel constant; nu 0.01 [m^2/s];
