evidence/of13-high-gradient-v2/incomplete-rerun-2026-10-02/0/U
FoamFile { format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField nonuniform List<vector>
262144
(
(-0.0011915429943377038 -0.24401740861137208 0)
(-0.0033932273634893371 -0.20686797017360808 0)
(-0.0050783236262323663 -0.13822475853973162 0)
(-0.0059902911519998251 -0.048538080428737383 0)
(-0.0059902911519998251 0.048538080428737349 0)
(-0.0050783236262323672 0.13822475853973154 0)
(-0.0033932273634893371 0.20686797017360811 0)
(-0.001191542994337706 0.24401740861137208 0)
...
);
boundaryField {
xm { type cyclic; }
xp { type cyclic; }
ym { type cyclic; }
yp { type cyclic; }
zm { type cyclic; }
zp { type cyclic; }
}
