evidence/of13-high-gradient-v2/incomplete-rerun-2026-10-02/0/p
FoamFile { format ascii; class volScalarField; object p; }
dimensions [0 2 -2 0 0 0 0]; internalField uniform 0;
boundaryField {
xm { type cyclic; }
xp { type cyclic; }
ym { type cyclic; }
yp { type cyclic; }
zm { type cyclic; }
zp { type cyclic; }
}
